УчетВУправляющихДляГит1/src/Documents/РасходыНаОнлайнКассыУменьшающиеНалоги/РасходыНаОнлайнКассыУменьшающиеНалоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходыНаОнлайнКассыУменьшающиеНалоги</name>
  <registerRecords>AccumulationRegister.РасходыНаОнлайнКассыУменьшающиеЕНВД</registerRecords>
  <attributes>
    <name>УменьшаемыйНалог</name>
    <type>
      <types>EnumRef.ВидыНалоговУменьшаемыхНаРасходыККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

УчетВУправляющихДляГит1/src/AccumulationRegisters/РасходыНаОнлайнКассыУменьшающиеЕНВД/РасходыНаОнлайнКассыУменьшающиеЕНВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасходыНаОнлайнКассыУменьшающиеЕНВД</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРасхода</name>
    <type>
      <types>DocumentRef.РасходыНаОнлайнКассыУменьшающиеНалоги</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УчетВУправляющихДляГит1/src/Enums/ВидыНалоговУменьшаемыхНаРасходыККТ/ВидыНалоговУменьшаемыхНаРасходыККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНалоговУменьшаемыхНаРасходыККТ</name>
  <enumValues>
    <name>ЕНВД</name>
  </enumValues>
  <enumValues>
    <name>Патент</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/РасходыНаОнлайнКассыУменьшающиеНалоги/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Процедура СформироватьДвиженияРегистрацияРасходовУменьшающихЕНВД(ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТаблицаРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПодготовитьПараметрыРегистрацияРасходовУменьшающихЕНВД(ТаблицаРеквизиты);
	
	ДанныеРасхода = Параметры.Реквизиты[0];
	
	Если ДанныеРасхода.УменьшаемыйНалог <> Перечисления.ВидыНалоговУменьшаемыхНаРасходыККТ.ЕНВД Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.РасходыНаОнлайнКассыУменьшающиеЕНВД.ДобавитьПриход();
	ЗаполнитьЗначенияСвойств(Движение, ДанныеРасхода);
	
	Движения.РасходыНаОнлайнКассыУменьшающиеЕНВД.Записывать = Истина;
	
КонецПроцедуры

Функция ПределРасходовНаОнлайнКассу() Экспорт
	
	// К уменьшению ЕНВД принимаются расходы в сумме не более 18 000 рублей
	// ((п. 2.2 статьи 346.32 НК РФ, п. 1.1 статьи 346.51 НК РФ).
	Возврат 18000;
	
КонецФункции

Функция МинимальнаяДатаРегистрацииКассы() Экспорт
	
	// Допускается уменьшать налог на расходы по покупке касс, зарегистрированных с 1 февраля 2017 г.
	// (п. 2.2 статьи 346.32 НК РФ, п. 1.1 статьи 346.51 НК РФ).
	Возврат НачалоДня(Дата(2017, 2, 1));
	
КонецФункции

Функция МаксимальнаяДатаРегистрацииКассы() Экспорт
	
	// Допускается уменьшать налог на расходы по покупке касс, зарегистрированных до 1 июля 2019 г.
	// ((п. 2.2 статьи 346.32 НК РФ, п. 1.1 статьи 346.51 НК РФ).
	Возврат КонецДня(Дата(2019, 7, 1));
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
	
	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДокументРасходыНаОнлайнКассы.Ссылка КАК Регистратор,
	|	ДокументРасходыНаОнлайнКассы.Дата КАК Период,
	|	ДокументРасходыНаОнлайнКассы.УменьшаемыйНалог КАК УменьшаемыйНалог,
	|	ДокументРасходыНаОнлайнКассы.Организация КАК Организация,
	|	ДокументРасходыНаОнлайнКассы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ДокументРасходыНаОнлайнКассы.Ссылка КАК ДокументРасхода,
	|	ДокументРасходыНаОнлайнКассы.СуммаДокумента КАК Сумма
	|ИЗ
	|	Документ.РасходыНаОнлайнКассыУменьшающиеНалоги КАК ДокументРасходыНаОнлайнКассы
	|ГДЕ
	|	ДокументРасходыНаОнлайнКассы.Ссылка = &Ссылка"
	;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ПодготовитьПараметрыРегистрацияРасходовУменьшающихЕНВД(ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы реквизитов для регистрации расходов на онлайн-кассы.
	СписокОбязательныхКолонок = ""
	+ "Период,"                      // <Дата> - дата документа, записывающего движения
	+ "Регистратор,"                 // <ДокументСсылка.РасходыНаОнлайнКассыУменьшающиеНалоги> - документ, записывающий движения в регистры
	+ "УменьшаемыйНалог,"            // <ПеречислениеСсылка.ВидыНалоговУменьшаемыхНаРасходыККТ> - вид уменьшаемого налога
	+ "Организация,"                 // <СправочникСсылка.Организации> - организация документа
	+ "РегистрацияВНалоговомОргане," // <СправочникСсылка.РегистрацииВНалоговомОргане> - регистрация в ИФНС, к которой относятся расходы
	+ "ДокументРасхода,"             // <ДокументСсылка.РасходыНаОнлайнКассыУменьшающиеНалоги> - документ регистрации расхода на онлайн-кассу
	+ "Сумма"                        // <Число, 10, 0> - сумма расходов на онлайн-кассу
	;
	
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

#Область ОбработчикиОбновления

Процедура ЗаполнитьУменьшаемыйНалог() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходыНаОнлайнКассыУменьшающиеНалоги КАК РасходыНаОнлайнКассыУменьшающиеНалоги
	|ГДЕ
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.УменьшаемыйНалог = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговУменьшаемыхНаРасходыККТ.ПустаяСсылка)"
	;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		// До появления реквизита документ регистрировал только расходы, уменьшающие ЕНВД.
		ДокументОбъект.УменьшаемыйНалог = Перечисления.ВидыНалоговУменьшаемыхНаРасходыККТ.ЕНВД;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
